app/views/news/technews.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
          <% if !session[:current_user].nil? %>
                <% logged_user = User.find(session[:current_user]) %>

SELECT `blogs`.* FROM `blogs`
---
        <h1 class="my-4 ms-3"> Latest Blogs</h1>
     <% Blog.all.map do |cur_post| %>

SELECT  `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`blog_id` = 1 LIMIT 1
---
                <div class="col-9 mb-1">
                  <% like_exist = Like.find_by(user_id: session[:current_user], blog_id: cur_post['id']).nil? %>